#include "stm32f1xx_hal.h"
#include "MyRTC.h"
#include "Menu.h"
#include "OLED.h"
#include "Key.h"
#include "SetTime.h"
#include "dino.h"
#include "MPU6050.h"
#include "lift_int.h"
#include "AD.h"
#include "tim.h"
#include "public.h"
#include "step_counting.h"



/*自加*/

//#include "FreeRTOSConfig.h" 
//#include "FreeRTOS.h"

#include "main.h"
#include "cmsis_os.h"
////////////#include "queue.h"
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"


/*引自main.c的函数-------------------------------------------------------------------------*/

extern uint8_t time_count_flag;/*引自main.c*/
extern uint32_t time_count_ms;/*引自main.c*/
extern uint32_t time_count_s;/*引自main.c*/
extern uint32_t ScreenOff_Permit;/*引自main.c*/
extern void Enter_StopMode(void);/*引自main.c*/
extern void	My_Send_Task_Queue(uint8_t val);/*引自main.c*/
extern uint8_t now_flag;/*引自main.c*/
extern uint8_t resume_flag;/*引自main.c*/
extern uint8_t first_open_flag;/*引自main.c*/
extern uint8_t key_irq;/*引自main.c*/

/*-------------------------------------------------------------------------引自main.c的函数*/



uint8_t music_running_flag = 0;
uint8_t stop_watch_running_flag = 0;
uint8_t flash_running_flag = 0;




/*
说明：这个标志位反映的是目前状态是否是从其他页面返回到首页来，如果是，亮屏计时归零。只有首页要超时熄屏
*/
uint8_t back_to_home_flag = 0;


//void Menu_Init(void)
//{
//	MyRTC_Init();
//	Key_Init();
//	AD_Init();
//	LED_Init();
//}


/*说明：UI函数都是用于被调用的*/











///////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////首页显示	BEGIN////////////////////////////////////////////////////////////////////////////////////////////
/////首页显示	BEGIN////////////////////////////////////////////////////////////////////////////////////////////
/////首页显示	BEGIN////////////////////////////////////////////////////////////////////////////////////////////
/////首页显示	BEGIN////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////

unsigned int open_time=0;
uint8_t KeyNum;


/*电池电压检测-----------------------------------------------------------------------------*/

uint16_t ADValue;//存放读取到的AD值的变量
float VBAT;//存放电池电压的变量
int Battery_Capacity;//电池电量的变量

void Show_Battery(void)
{
	
	int sum=0;//在这个函数里定义，每次重新执行这个函数时候，这个变量又归零
	for(int i=0;i<3000;i++)
	{
		ADValue=AD_GetValue();
		sum+=ADValue;
	}
	ADValue=sum/3000;//这就是进行了均值滤波	
	VBAT=(float)ADValue/4095*3.3;
	
	
	Battery_Capacity=(ADValue-3296)*100/799;//乘100是因为直接转成百分比
	if(Battery_Capacity<0){Battery_Capacity=0;}
	
		
	if(Battery_Capacity==100)
	{OLED_ShowNum(85,4,Battery_Capacity,3,OLED_6X8);}
	else if(Battery_Capacity>=10)
	{OLED_ShowNum(91,4,Battery_Capacity,2,OLED_6X8);}
	else if(Battery_Capacity<10)
	{OLED_ShowNum(97,4,Battery_Capacity,1,OLED_6X8);}
	OLED_ShowChar(103,4,'%',OLED_6X8);
	
	
	
	if(Battery_Capacity==100)
	{OLED_ShowImage(110,0,16,16,battery);}
	else if(Battery_Capacity>=0)
	{
		OLED_ShowImage(110,0,16,16,battery);
		OLED_ClearArea((112+Battery_Capacity/10),5,(10-Battery_Capacity/10),6);
	}
	
}

/*-----------------------------------------------------------------------------电池电压检测*/




//首页UI--------------------------------------------------------------------------//

void Show_Clock_UI(void)
{
	
	MyRTC_ReadTime();
	OLED_Clear();
	Show_Battery();
	//第一行显示 年-月-日 起始(0,0),横占59像素，竖占8像素
	OLED_Printf(0,0,OLED_6X8,"%d-%d-%d,",MyRTC_Time[0],MyRTC_Time[1],MyRTC_Time[2]);
//////	OLED_Printf(0,8,OLED_6X8,"step:%d",step_count);
//////	OLED_Printf(0,8,OLED_6X8,"now_flag:%d",now_flag);
//////	OLED_Printf(62,8,OLED_6X8,"r:%d",resume_flag);
	
	//第一行后面显示星期英文,起始(60,0),横占24像素，竖占8像素
	switch(MyRTC_Time[6]) 
		{
    case 0: OLED_Printf(60,0,OLED_6X8,"Sun.");OLED_ShowChinese(72,48,"日"); break;
    case 1: OLED_Printf(60,0,OLED_6X8,"Mon.");OLED_ShowChinese(72,48,"一"); break;
		case 2: OLED_Printf(60,0,OLED_6X8,"Tue.");OLED_ShowChinese(72,48,"二"); break;
		case 3: OLED_Printf(60,0,OLED_6X8,"Wed.");OLED_ShowChinese(72,48,"三"); break;
		case 4: OLED_Printf(60,0,OLED_6X8,"Thu.");OLED_ShowChinese(72,48,"四"); break;
		case 5: OLED_Printf(60,0,OLED_6X8,"Fri.");OLED_ShowChinese(72,48,"五"); break;
		case 6: OLED_Printf(60,0,OLED_6X8,"Sat.");OLED_ShowChinese(72,48,"六"); break;
		}
		
//////////					OLED_Printf(0,15,OLED_6X8,"%d",HAL_GPIO_ReadPin(GPIOB,GPIO_PIN_13));
//////////		
//////////					OLED_Printf(0,35,OLED_6X8,"%x",MPU6050_GetID());		
		
	//在(16,16)显示 时-分-秒
	OLED_Printf(8,18,OLED_14X28,"%02d:%02d:%02d",MyRTC_Time[3],MyRTC_Time[4],MyRTC_Time[5]);
		
	//显示菜单图标
	OLED_ShowImage(3,48,16,16,Menu_ico);
		
//////////OLED_Printf(32,48,OLED_6X8,"step:%d",step_count);

	//显示设置图标
	OLED_ShowImage(109,48,16,16,Setting_ico);
		
	//显示星期几（在底部）
	OLED_ShowChinese(40,48,"星期");
	
	//显示条条框框
	OLED_DrawLine(0,17,128,17);
	OLED_DrawLine(0,46,128,46);
	OLED_DrawLine(85,0,85,16);
	OLED_DrawLine(24,46,24,64);
	OLED_DrawLine(104,46,104,64);
		
	//显示步数，（0,48）
	OLED_ShowImage(0,8,8,8,Step_ico_samll);
	OLED_Printf(8,8,OLED_6X8,"%d",step_count);
		
		
	
////////////		uint16_t sample_count = MPU6050_ReadFIFO_Accel(buffer_test, 100) ;

////////////		OLED_Printf(0,8,OLED_6X8,"X=%d, Y=%d, Z=%d\r\n",buffer_test[5].x, buffer_test[5].y, buffer_test[5].z);



}

//--------------------------------------------------------------------------首页UI//


//首页光标操作--------------------------------------------------------------------------//

int Clkflag=1;//光标指示标志位
//首页的不断取按键值并判断的函数
void FirstPage_Clock(void *argument)//注意这个函数它的返回值是int，用于判断是要跳转到哪个界面
{	
	while(1)
	{
		OLED_Clear();
		KeyNum=Key_GetNum();
			
			//Clkflag是选中哪一项的标志位，当光标选中“菜单”时，Clkflag=1，当光标选中“设置”时，Clkflag=2
			
			if(KeyNum !=0 && now_flag == 1)
			{
				key_irq = 1;
			}
			//判断按下哪个键（在亮屏情况下）
			else if(KeyNum != 0 && now_flag == 0)
			{
				//亮屏计时手动复零
				time_count_ms = 0;
				time_count_s = 0;
				
				open_time=0;
				if(KeyNum==1)//上一项
				{
					Clkflag--;
					if(Clkflag<=0)
						{
						Clkflag=2;
						}
				}
				else if(KeyNum==2)//下一项
					{
						Clkflag++;
						if(Clkflag>=3)
						{
							Clkflag=1;
						}
					}
					else if(KeyNum==3 && first_open_flag == 1)//开机初启
					{first_open_flag = 0;}
					else if(KeyNum==3 && first_open_flag == 0)
					{	
						OLED_Clear();//清屏准备跳转页面
						OLED_Update();
						//发送数据到页面管理列表
						if(Clkflag == 1)
						{
							My_Send_Task_Queue(PAGE_MENU);
							ScreenOff_Permit = 0;
						}
						else if(Clkflag == 2)
						{
							My_Send_Task_Queue(PAGE_SETTING);
							ScreenOff_Permit = 1;
						}
////////						return Clkflag;	//只在选中的这个case里返回值，这样在main函数里clkflag1得到的就只有是选中的时候才有对应返回值（1或2），其他情况不返回
				
					}
				else if(KeyNum==4)//被长按关机
				{
					HAL_GPIO_WritePin(GPIOB,GPIO_PIN_13,GPIO_PIN_RESET);
					HAL_GPIO_WritePin(GPIOB,GPIO_PIN_12,GPIO_PIN_SET);
				}
			}	
		switch(Clkflag)
		{
			case 1:
				Show_Clock_UI();//显示主页UI
				OLED_ReverseArea(3,48,16,16);//选中即反色
				OLED_Update();
				break;
			case 2:
				Show_Clock_UI();//显示主页UI
				OLED_ReverseArea(109,48,16,16);//选中即反色
				OLED_Update();
				break;
				
		}
	

	
			// RTOS 延时
    vTaskDelay(pdMS_TO_TICKS(10));
	}
}


//--------------------------------------------------------------------------首页光标操作//

///////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////首页显示	END////////
///////////////////////////////////////////////////////////////////////////////////////首页显示	END////////
///////////////////////////////////////////////////////////////////////////////////////首页显示	END////////
///////////////////////////////////////////////////////////////////////////////////////首页显示	END////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////










///////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////设置功能	BEGIN////////////////////////////////////////////////////////////////////////////////////////////
/////设置功能	BEGIN////////////////////////////////////////////////////////////////////////////////////////////
/////设置功能	BEGIN////////////////////////////////////////////////////////////////////////////////////////////
/////设置功能	BEGIN////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////









/*“设置”界面UI------------------------------------------------------------------------*/

void Show_SettingPage_UI(void)
{
	OLED_ShowImage(0,0,16,16,Return);
	OLED_ShowChinese(0,16,"日期时间设置");
}

/*------------------------------------------------------------------------“设置”界面UI*/



/*“设置”界面光标操作------------------------------------------------------------------------*/

int Setflag=1;//这个是设置界面的光标位置指示位
//这个函数是在这个设置界面里操作光标
void SettingPage(void *argument)
{
	
	
	while(1)
	{
	OLED_Clear();
		
	uint8_t SetFlag_Temp=0;//这个临时变量是用来存放在设置界面光标的指示位的
	//使用临时变量而不用SetFlag的原因是：
	//SetFlag并不能反应按下了“确认”，它指示的是光标选中了哪个选项
	//所以在 按下“确认” 的时候把SetFlag的值赋给临时变量SetFlag_Temp
	//那么SetFlag_Temp就既能说明 已经按下了“确认”，并且它的值指示了是光标选中了哪个选项
		
	KeyNum=Key_GetNum();
		if(KeyNum !=0 && now_flag == 1)
		{
			key_irq = 1;
		}
	//判断按下哪个键（在亮屏情况下）
		if(KeyNum != 0 && now_flag == 0)
		{
			//亮屏计时手动复零
				time_count_ms = 0;
				time_count_s = 0;
		if(KeyNum==1)//上一项
		{
			Setflag--;
			if(Setflag<=0)
				{
				Setflag=2;
				}
		}
		else if(KeyNum==2)//下一项
			{
				Setflag++;
				if(Setflag>=3)
				{
					Setflag=1;
				}
			}
		else if(KeyNum==3)//确认
			{	
				OLED_Clear();//清屏准备跳转页面
				OLED_Update();	
				//return Setflag;	//只在选中的这个case里返回值，这样在main函数里clkflag1得到的就只有是选中的时候才有对应返回值（1或2），其他情况不返回
				//本来是return返回一个值，这里用变量SetFlag_Temp来存放，然后判断这个变量
				SetFlag_Temp=Setflag;
				//当按下“确认”按键时，给SetFlag_Temp赋值，指示现在选中的是哪个
				//逻辑：如果没按这个“确认”按键，SetFlag_Temp的值是0，说明未按下安静
				//		如果按下了“确认”按键，SetFlag_Temp就有值，而且其值指示现在选中的是哪个
				//		所以在下面加上对SetFlag_Temp的值的判断函数
				//注意这个SetFlag_Temp要清零
			}
		}
			
		//对SetFlag_Temp的值的判断函数
		if(SetFlag_Temp==1)//说明选中的是返回键并且按下了
		{
			back_to_home_flag = 1;
			My_Send_Task_Queue(PAGE_HOME);
			ScreenOff_Permit = 0;
		}
		else if(SetFlag_Temp==2)//说明选中的是“日期时间设置”并且按下了
		{
			OLED_Clear();//先清屏
			/*向页面管理队列写数据*/
			My_Send_Task_Queue(PAGE_SETTIME);
			ScreenOff_Permit = 1;
			
		}
			
	switch(Setflag)
	{
		case 1:
			Show_SettingPage_UI();
			OLED_ReverseArea(0,0,16,16);//选中即反色
			OLED_Update();
			break;
		case 2:
			Show_SettingPage_UI();
			OLED_ReverseArea(0,16,96,16);//选中即反色
			OLED_Update();
			break;
}
		//RTOS延时
		vTaskDelay(pdMS_TO_TICKS(10));
	}
}

/*------------------------------------------------------------------------“设置”界面光标操作*/


///////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////设置功能	END////////
///////////////////////////////////////////////////////////////////////////////////////设置功能	END////////
///////////////////////////////////////////////////////////////////////////////////////设置功能	END////////
///////////////////////////////////////////////////////////////////////////////////////设置功能	END////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////










///////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////菜单功能	BEGIN////////////////////////////////////////////////////////////////////////////////////////////
/////菜单功能	BEGIN////////////////////////////////////////////////////////////////////////////////////////////
/////菜单功能	BEGIN////////////////////////////////////////////////////////////////////////////////////////////
/////菜单功能	BEGIN////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////



/*滑动菜单界面-------------------------------------------------------------------------------------*/

//一次显示3个图标（图标为32*32）
//最左边图标的X坐标为0
//正中间图标的X坐标为48
//最右边图标的X坐标为96
//每两个图标之间的间距为16



/*
动画的原理逻辑：
		在外部的while循环里调用Menu_Aniamtion()函数
		这样就会不断地对pre_selection和target_selection进行判断
		只要pre_selection不等于target_selection（当按键按下时，target_selection的值改变）
		就会触发Menu_Aniamtion()函数里的两个if判断，判断是向右移还是向左移
		向左移和向右移是对称的，现在以向左移为例
		向左移的代码里，x_pre -= Speed;这句就使x_pre的值不断（以speed步长）递减
		在下面有个函数，OLED_ShowImage(x_pre,16,32,32,Menu_Graph[pre_selection]);
		只要pre_selection和target_selection不等，x_pre就会不断变化（递增或递减）
		直到pre_selection和target_selection相等
		这是这个 上次选项 所对应的图标就已移动到所要到达的地方
		而且在移动完成后，会完成对各参数的修改
*/


	
/*定义滑动菜单要用到的全局变量-----------------------------------------------------------------------------*/

/*全局变量，不会随任务创建删除而被创建删除，是保存在内存中的*/

	int menuFlag=1;//菜单界面的光标指示标志位
	//这个指示标志位反应的是当前选中图标的索引号

	uint8_t pre_selection;//上次选择的选项（即当前选项）
	uint8_t target_selection;//目标选项（即按下按键后要到达的选项）
	//以上两个selection指向Menu_Graph数组中各个图形的索引值
	//这个“上次和下次”都是针对 要移动 来说的，应该把每次的 静止 都看成 要移动
	
	uint8_t x_pre = 48;//上次选项的x坐标
	uint8_t Speed = 4;//速度，其实就是移动的步长
	uint8_t move_flag=0;//开始移动的标志位，1表示开始移动，0表示移动停止，初值给0

/*-----------------------------------------------------------------------------定义滑动菜单要用到的全局变量*/



/*图标滑动函数-----------------------------------------------------------------------------*/

//全部由 7 个图标
void Menu_Aniamtion(void)
{
	OLED_Clear();//先清屏
	OLED_ShowImage(42,10,44,44,Frame);//画边框
	
// #1.判断当前选项的索位号 和 目标选项的索位号的大小关系来得到整体三个图标的移动方向，本质就是修改x_pre
	if(pre_selection<target_selection)//判断是否 当前选项的索位号 小于 目标选项的索位号（即要将当前移到比当前小的地方去）
		//若是，则整体三个图标向左移动
	{
		
		x_pre -= Speed;//上次选项的x坐标（本来在中央）不断以speed的步长来减去（就是移动了）
		/*注意：只要通过改动x_pre就可以控制界面的三个图标一起动。因为界面的三个图标的x坐标分别是：x_pre-48、x_pre、x_pre+48，都与x_pre是相关的*/
		
		if(x_pre==0)//判断是否完成移动的方法：当前选项的x坐标（本来在中央48）被移动到0时，移动完成
		{
			//当前图标向左移动完成后的对各参数的修改
			pre_selection=target_selection;//这时“上次选项”的索位号就加一
			move_flag=0;//移动标志位置零
			x_pre=48;//这时“新的上次选项”（即当前）的X坐标位就变为48即正中央
		}
	}
	
	else if(pre_selection>target_selection)//判断是否 当前选项的索位号 大于 目标选项的索位号（即要将当前移到比当前大的地方去）
		//若是，则整体三个图标向右移动
	{
		
		x_pre += Speed;//上次选项（本来在中央）的x坐标不断以speed的步长来增加（就是移动了）
		/*注意：只要通过改动x_pre就可以控制界面的三个图标一起动。因为界面的三个图标的x坐标分别是：x_pre-48、x_pre、x_pre+48，都与x_pre是相关的*/
		
		if(x_pre==96)//判断是否完成移动的方法：当前选项的x坐标（本来在中央48）被移动到96时，移动完成
		{
			//当前图标向右移动完成后的对各参数的修改
			pre_selection=target_selection;//这时“上次选项”的索位号就加一
			move_flag=0;//移动标志位置零
			x_pre=48;//这时“新的上次选项”（即当前）的X坐标位就变为48即正中央
		}
	}
	
// #2.将不断被修改的x_pre来体现到图形坐标里去到OLED显示，表现出移动	
	
	/* ---上次选项 所对应的图标的移动--*/
	OLED_ShowImage(x_pre,16,32,32,Menu_Graph[pre_selection]);
	//这个就是 上次选项 所对应的图标不断移动的函数
	//因为只要pre_selection和target_selection不等
	//x_pre就会不断变化（递增或递减），直到pre_selection和target_selection相等
	//这是这个 上次选项 所对应的图标就已移动到所要到达的地方
	
	
	/*---非上次选项 所对应的图标的移动----*/
	//上次选项 的前面（左边）的图标的移动：
	//只有当pre_selection>=1时，它的前面才会有图标
	//这时三个整体移动，它前面的图标才会移动
	if(pre_selection>=1)
	{
		OLED_ShowImage(x_pre-48,16,32,32,Menu_Graph[pre_selection-1]);
	}
	//上次选项 的后面（右边）的图标的移动
	//只有当pre_selection<=4时，它的后面才会有图标
	//这时三个整体移动，它后面的图标才会移动
	if(pre_selection<=5)
	{
		OLED_ShowImage(x_pre+48,16,32,32,Menu_Graph[pre_selection+1]);
	}
	
	//上次选项 的前面第二个（左边界的左边）的图标的移动
	//只有当pre_selection>=2时，左边界的左边才会有图标
	//这时三个整体移动，左边界的左边的图标才会移动
	if(pre_selection>=2)
	{
		OLED_ShowImage(x_pre-96,16,32,32,Menu_Graph[pre_selection-2]);
	}
	
	//上次选项 的后面第二个（右边界的右边）的图标的移动
	//只有当pre_selection<=4时，右边界的右边才会有图标
	//这时三个整体移动，右边界的右边的图标才会移动
	if(pre_selection<=5)
	{
		OLED_ShowImage(x_pre+96,16,32,32,Menu_Graph[pre_selection+2]);
	}
	
	
	OLED_Update();
}

/*-----------------------------------------------------------------------------图标滑动函数*/



/*通过按键来改变pre_selection和target_selection的函数-------------------------------------*/

void Set_Selection(uint8_t mov_flag,uint8_t Pre_Selection,uint8_t Target_Selection)
{
	if(move_flag==1)//move_flag移动标志位如果被置一
	//就改变pre_selection和target_selection的值使发生移动了
	//上面那个函数被放在循环里，不断检测pre_selection和target_selection的值相不相同
	{
		pre_selection=Pre_Selection;
		target_selection=Target_Selection;
	}
	Menu_Aniamtion();
}

/*--------------------------------------通过按键来改变pre_selection和target_selection的函数*/

	
	
	
	
/*菜单界面UI--------------------------------------------------------------------------------*/

//menuflag是由menuFlag传入
//当前中央图标的索位号（0到7）是 menuFlag （menuflag）的值 -1 
	
void ShowMenu_UI(uint8_t menuflag)
{
	
	OLED_Clear();
	
	OLED_ShowImage(42,10,44,44,Frame);
	
	int left,middle,right;

	if(menuflag==1) //当前中央图标的索位号为0
	{
		middle=0;//中间是索位号为0的图标
		left=7;//左边是空白图标
		right=1;//右边是索位号为1的图标
	}
	else if(menuflag==7)//当前中央图标的索位号为6（最后一个图标）
	{
		middle=6;//中间是索位号为0的图标
		left=5;//左边是索位号为5的图标
		right=7;//右边是索位号为7的图标
	}
	else//当前中央图标的索位号为 menuFlag - 1
	{
		middle=menuflag-1;//中间是索位号为 menuFlag - 1的图标
		left=menuflag-2;//左边是索位号为 menuFlag - 2的图标
		right=menuflag;//右边边是索位号为 menuFlag的图标
	}
	
	OLED_ShowImage(0,16,32,32,Menu_Graph[left]);//左边
	OLED_ShowImage(48,16,32,32,Menu_Graph[middle]);//中央
	OLED_ShowImage(96,16,32,32,Menu_Graph[right]);//右边
	
	OLED_Update();
}

/*--------------------------------------------------------------------------------菜单界面UI*/



/*菜单界面光标操作--------------------------------------------------------------------------------*/

void Menu(void *argument)
{
	

	
	uint8_t DirecFlag=0;//这是指代 按键按下后 是要将当前中央的图标移动到上一项还是下一项的 标志位
	//置1：移动到上一项
	//置2：移动到下一项
	//每次检测到按键被按下，会对这个标志位置位
	//然后调用 通过按键来改变pre_selection和target_selection的函数

	uint8_t menuFlag_temp=menuFlag;
			//因为左右移键一旦按下，menuFlag就发生变化
			//这个变量用于存储按键按下之前menuFlag的值
			//用来判断后续移动操作
	
	
		while(1)
		{
			OLED_Clear();
			KeyNum=Key_GetNum();
			uint8_t menu_flag_temp=0;//临时标志位，原理同上，用于确认时候的
		if(KeyNum !=0 && now_flag == 1)
		{
			key_irq = 1;
		}
		//判断按下哪个键（在亮屏情况下）
		if(KeyNum != 0 && now_flag == 0)
		{
			//亮屏计时手动复零
				time_count_ms = 0;
				time_count_s = 0;
			if(KeyNum==1&& x_pre==48)//上一项(左键 PB1键)
			{
				DirecFlag=1;//要移动到上一项还是下一项的 标志位 置1，表示要移到上一项（整体左移）
				move_flag=1;//移动标志位置1，表示要开始移动
				menuFlag_temp=menuFlag;
				menuFlag--;
				if(menuFlag<=0)
				{menuFlag=7;}
			}
			else if(KeyNum==2 && x_pre==48)//下一项（右键 PA6键）
				{
					DirecFlag=2;//要移动到上一项还是下一项的 标志位 置2，表示要移到下一项（整体右移）
					move_flag=1;//移动标志位置1，表示要开始移动
					menuFlag_temp=menuFlag;
					menuFlag++;
					if(menuFlag>=8)//本来>=9
					{menuFlag=1;}
				}
			else if(KeyNum==3 && x_pre==48)//确认（PA4键）
				{	
					OLED_Clear();//清屏准备跳转页面
					OLED_Update();	
	//				return menuFlag;	//只在选中的这个case里返回值，这样在main函数里clkflag1得到的就只有是选中的时候才有对应返回值（1或2），其他情况不返回
					menu_flag_temp = menuFlag;//临时标志位，原理同上，用于确认时候的。特别注意每次while循环开头要给这个临时标志位清零
				}
			}
			
			
						/*确定是按下“确认”后的 辨别跳转*/
				if(menu_flag_temp==1)
				{
					/*back_to_home_flag = 1;	注意：这个还没用别的替代*/
					/*向页面管理队列写数据*/
					My_Send_Task_Queue(PAGE_HOME);
					ScreenOff_Permit = 0;
				}
				else if(menu_flag_temp==2)
				{
					/*向页面管理队列写数据*/
					My_Send_Task_Queue(PAGE_STOPWATCH);
					ScreenOff_Permit = 1;
				}
				else if(menu_flag_temp==3)
				{
					/*向页面管理队列写数据*/
					My_Send_Task_Queue(PAGE_FLASH);
					ScreenOff_Permit = 1;
				}
				else if(menu_flag_temp==4)
				{
					/*向页面管理队列写数据*/
					My_Send_Task_Queue(PAGE_MUSIC);
					ScreenOff_Permit = 1;
				}
				else if(menu_flag_temp==5)
				{
					/*向页面管理队列写数据*/
					My_Send_Task_Queue(PAGE_DINO);
					ScreenOff_Permit = 1;
				}
				else if(menu_flag_temp==6)
				{
					/*向页面管理队列写数据*/
//					My_Send_Task_Queue(PAGE_MUSIC);
//					ScreenOff_Permit = 1;
				}
				
				
//////////////////						else if(menu_flag_temp==3){flashpage();}
//////////////////////////						else if(menu_flag_temp==4){}
//////////////////						else if(menu_flag_temp==5){dinopage();}
//////////////////////////						else if(menu_flag_temp==6){}
//////////////////////////						else if(menu_flag_temp==7){Gradienter();}
			
				
			/*这个一连串if函数是例行的判断*/
			/*判断内容：
							0.因为原理是通过不断调用这个int Menu()的UI函数来显示UI
							1.如果没有要发生移动，判断光标现在在哪，从而把现在UI显示出来
							2.如果要发生移动，就执行图标移动函数
			*/
				
				
				#define Num 7 //全部图标数量

				if(DirecFlag==1)//移动标志位为1： 向上/左移动
				{
					if(menuFlag_temp == 1)
					{ShowMenu_UI(Num);}
					
					else if(menuFlag_temp >= 2 && menuFlag_temp <= Num)// 边界处理
					{Set_Selection(move_flag,menuFlag_temp-1,menuFlag_temp-2);}					
				}	
				else if(DirecFlag==2)//移动标志位为2： 向下/右移动
				{
					if(menuFlag_temp >= 1 && menuFlag_temp <=Num - 1)// 边界处理
					{Set_Selection(move_flag,menuFlag_temp-1,menuFlag_temp);}
				
					else if(menuFlag_temp == Num)
					{ShowMenu_UI(1);}
				}
				else//移动标志位为其他，保持静止，显示当前
				{
					ShowMenu_UI(menuFlag_temp);
				}
					
				//RTOS延时
				vTaskDelay(pdMS_TO_TICKS(10));
				
			}
}

/*--------------------------------------------------------------------------------菜单界面光标操作*/

///////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////菜单功能	END////////
///////////////////////////////////////////////////////////////////////////////////////菜单功能	END////////
///////////////////////////////////////////////////////////////////////////////////////菜单功能	END////////
///////////////////////////////////////////////////////////////////////////////////////菜单功能	END////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////










///////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////秒表功能	BEGIN////////////////////////////////////////////////////////////////////////////////////////////
/////秒表功能	BEGIN////////////////////////////////////////////////////////////////////////////////////////////
/////秒表功能	BEGIN////////////////////////////////////////////////////////////////////////////////////////////
/////秒表功能	BEGIN////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////









/*秒表：计时器初始化、定义数组、变量-----------------------------------------------------------*/

int stopwatch_UI(void);//先声明一下秒表的UI函数

unsigned char time_buf[4]={0,0,0,0};//这个数组存放 分、秒、秒下面两位，都是两位两位，最后一位是小时数

int sec_cen_total=0; //计数器的秒数总计，因为秒下面有两位，这里总数算的是秒下面两位为基本单位

uint8_t stopwatch_flag = 1;

uint8_t open_clk=0;//开始计时标志位，置1就是在计时，置0就是没在计时，初始是0

uint8_t stopwatch_update_flag = 0;//中断到的标志位

uint8_t paulse=0;//开始计时后暂时停止的标志位
//置0表示：没有在计时过程中按暂停
//置1表示：在计时过程中按了暂停
//关系到：计时过程中“计次”要变成“继续”

unsigned char time_lap_buf0[4]={0,0,0,0};//计次的数组0
unsigned char time_lap_buf1[4]={0,0,0,0};//计次的数组1
unsigned char time_lap_buf2[4]={0,0,0,0};//计次的数组2
unsigned char time_lap_buf3[4]={0,0,0,0};//计次的数组3


uint8_t lap_flag=0;//计次到第几行的标志位



//TIM3的中断服务子程序，每10ms（0.01s）中断一次
void My_TIM3_IRQHandler(void)
{
	/*中断服务子程序只去实现一个置标志位*/
	stopwatch_update_flag = 1;
}


/*-----------------------------------------------------------秒表：计时器初始化、定义数组、变量*/






/*秒表UI------------------------------------------------------------------------------------------*/

int stopwatch_UI(void)
{			
	//显示计时
	OLED_Printf(16,3,OLED_8X16,"%02d:%02d.%02d",time_buf[0],time_buf[1],time_buf[2]);

	if(open_clk==0 && paulse==0)
	{
		OLED_ShowChinese(88,5,"开始");
	}
	else if(open_clk==1 && paulse==0)
	{
		OLED_ShowChinese(88,5,"计次");
	}
	else if(open_clk==0 && paulse==1)
	{
		OLED_ShowChinese(88,5,"继续");
	}
	OLED_ShowChinese(88,23,"暂停");
	OLED_ShowChinese(88,41,"退出");
	
	if(time_buf[3] != 0)
	{
		OLED_Printf(0,7,OLED_6X8,"%02dh",time_buf[3]);
	}
	
	//计次		
	if(lap_flag==1)
		{
			OLED_Printf(23,22,OLED_6X8,"%02d:%02d:%02d",time_lap_buf0[0],time_lap_buf0[1],time_lap_buf0[2]);
			if(time_lap_buf0[3]!=0){OLED_Printf(4,22,OLED_6X8,"%02dh",time_lap_buf0[3]);}//小时
		}
		else if(lap_flag==2)
		{
			OLED_Printf(23,22,OLED_6X8,"%02d:%02d:%02d",time_lap_buf0[0],time_lap_buf0[1],time_lap_buf0[2]);
			OLED_Printf(23,30,OLED_6X8,"%02d:%02d:%02d",time_lap_buf1[0],time_lap_buf1[1],time_lap_buf1[2]);
			if(time_lap_buf0[3]!=0){OLED_Printf(4,22,OLED_6X8,"%02dh",time_lap_buf0[3]);}//小时
			if(time_lap_buf1[3]!=0){OLED_Printf(4,30,OLED_6X8,"%02dh",time_lap_buf1[3]);}//小时
		}
		else if(lap_flag==3)
		{
			OLED_Printf(23,22,OLED_6X8,"%02d:%02d:%02d",time_lap_buf0[0],time_lap_buf0[1],time_lap_buf0[2]);
			OLED_Printf(23,30,OLED_6X8,"%02d:%02d:%02d",time_lap_buf1[0],time_lap_buf1[1],time_lap_buf1[2]);
			OLED_Printf(23,38,OLED_6X8,"%02d:%02d:%02d",time_lap_buf2[0],time_lap_buf2[1],time_lap_buf2[2]);
			if(time_lap_buf0[3]!=0){OLED_Printf(4,22,OLED_6X8,"%02dh",time_lap_buf0[3]);}//小时
			if(time_lap_buf1[3]!=0){OLED_Printf(4,30,OLED_6X8,"%02dh",time_lap_buf1[3]);}//小时
			if(time_lap_buf2[3]!=0){OLED_Printf(4,38,OLED_6X8,"%02dh",time_lap_buf2[3]);}//小时
		}
		else if(lap_flag==4)
		{
			OLED_Printf(23,22,OLED_6X8,"%02d:%02d:%02d",time_lap_buf0[0],time_lap_buf0[1],time_lap_buf0[2]);
			OLED_Printf(23,30,OLED_6X8,"%02d:%02d:%02d",time_lap_buf1[0],time_lap_buf1[1],time_lap_buf1[2]);
			OLED_Printf(23,38,OLED_6X8,"%02d:%02d:%02d",time_lap_buf2[0],time_lap_buf2[1],time_lap_buf2[2]);
			OLED_Printf(23,46,OLED_6X8,"%02d:%02d:%02d",time_lap_buf3[0],time_lap_buf3[1],time_lap_buf3[2]);
			if(time_lap_buf0[3]!=0){OLED_Printf(4,22,OLED_6X8,"%02dh",time_lap_buf0[3]);}//小时
			if(time_lap_buf1[3]!=0){OLED_Printf(4,30,OLED_6X8,"%02dh",time_lap_buf1[3]);}//小时
			if(time_lap_buf2[3]!=0){OLED_Printf(4,38,OLED_6X8,"%02dh",time_lap_buf2[3]);}//小时
			if(time_lap_buf3[3]!=0){OLED_Printf(4,46,OLED_6X8,"%02dh",time_lap_buf3[3]);}//小时
		}
	
}

/*------------------------------------------------------------------------------------------秒表UI*/





/*秒表光标操作函数----------------------------------------------------------------------------*/

void stopwatch(void *argument)
{
	while(1)
	{
	
	//秒表数据更新

	if(stopwatch_update_flag == 1)
	{
		stopwatch_update_flag = 0;
		//总数自增
		sec_cen_total += 1;
	
		//总秒数转为数组里的数
		time_buf[2] = sec_cen_total % 100;        // 0.01s 位  00~99
		time_buf[1] = (sec_cen_total/100) % 60;   // 秒
		time_buf[0] = (sec_cen_total/6000) % 60;  // 分
		time_buf[3] = (sec_cen_total / 360000);    //小时
	}	
		
	OLED_Clear();
		
	uint8_t stopwatch_flag_temp=0;
	KeyNum=Key_GetNum();
		
		if(KeyNum !=0 && now_flag == 1)
		{
			key_irq = 1;
		}
		//判断按下哪个键（在亮屏情况下）
		if(KeyNum != 0 && now_flag == 0)
		{
			//亮屏计时手动复零
				time_count_ms = 0;
				time_count_s = 0;
			if(KeyNum==1)//上一项
		{
			stopwatch_flag--;
			if(stopwatch_flag<=0)
				{
				stopwatch_flag=3;
				}
		}
		else if(KeyNum==2)//下一项
			{
				stopwatch_flag++;
				if(stopwatch_flag>=4)
				{
					stopwatch_flag=1;
				}
			}
		else if(KeyNum==3)//确认
			{	
				OLED_Clear();//清屏准备跳转页面
				OLED_Update();	

				stopwatch_flag_temp=stopwatch_flag;

			}
		}
			
			
		//Temp的值的判断函数
		if(stopwatch_flag_temp==1)//第一行被按下（开始 / 计次 / 继续）
		{
			if(open_clk==0 && paulse==0)					//按下前是没计时，按下就是开始计时
			{
				open_clk=1;//计时标志位置1表示在计时
				HAL_TIM_Base_Start_IT(&htim3);//开启计数器TIM3 + 开中断
			}
			
			else if(open_clk==1 && paulse==0)		//计时过程中，不是从按了“暂停”以后开始的
//			//这里出过bug，就是这个else没写
//			//else 不写的话，一按下“开始”按键，就会先上面那个open_clk==0成立，执行了open_clk=1;
//			//导致open_clk==1，然后接下来就这个if，这个if又成立
//			//就执行下面这些
//			//造成：一按下“开始”就计了一次次00:00:00
			{
					lap_flag++;if(lap_flag>4){lap_flag=1;}
					if(lap_flag==1)
					{
						time_lap_buf0[0] = time_buf[0];
						time_lap_buf0[1] = time_buf[1];
						time_lap_buf0[2] = time_buf[2];
						time_lap_buf0[3] = time_buf[3];
					}
					else if(lap_flag==2)
					{
						time_lap_buf1[0] = time_buf[0];
						time_lap_buf1[1] = time_buf[1];
						time_lap_buf1[2] = time_buf[2];
						time_lap_buf1[3] = time_buf[3];
					}
					else if(lap_flag==3)
					{
						time_lap_buf2[0] = time_buf[0];
						time_lap_buf2[1] = time_buf[1];
						time_lap_buf2[2] = time_buf[2];
						time_lap_buf2[3] = time_buf[3];
						
					}
					else if(lap_flag==4)
					{
						time_lap_buf3[0] = time_buf[0];
						time_lap_buf3[1] = time_buf[1];
						time_lap_buf3[2] = time_buf[2];
						time_lap_buf3[3] = time_buf[3];						
					}
			}
				else if(open_clk==0 && paulse==1)//从按了“暂停”以后开始的，这时这是按下“继续”
				{
					//再次开启计时
					paulse=0;
					open_clk=1;//计时标志位置1表示在计时
					HAL_TIM_Base_Start_IT(&htim3);//开启计数器TIM3 + 开中断
					
				}
				
			}
		
		
		else if(stopwatch_flag_temp==2)//第二行被按下（暂停）
		{
			HAL_TIM_Base_Stop_IT(&htim3);//关闭计数器TIM3 + 关中断
			open_clk=0;//计时标志位置0表示没有在计时
			paulse=1;//暂停标志位置1
						
		}
		
		else if(stopwatch_flag_temp==3)//第三行被按下（退出）
		{
			HAL_TIM_Base_Stop_IT(&htim3);//关闭计数器TIM3 + 关中断
			
			//标志位和数据值和临时数据都要清零再退出
			//各种标志位
			open_clk=0;
			paulse=0;
			lap_flag=0;
			//临时数据
			time_lap_buf0[0] = 0;
			time_lap_buf0[1] = 0;
			time_lap_buf0[2] = 0;	
			time_lap_buf1[0] = 0;
			time_lap_buf1[1] = 0;
			time_lap_buf1[2] = 0;	
			time_lap_buf2[0] = 0;
			time_lap_buf2[1] = 0;
			time_lap_buf2[2] = 0;
			time_lap_buf3[0] = 0;
			time_lap_buf3[1] = 0;
			time_lap_buf3[2] = 0;
			
			time_lap_buf0[3] = 0;
			time_lap_buf1[3] = 0;
			time_lap_buf2[3] = 0;
			time_lap_buf3[3] = 0;
			//保存的计时数据
			time_buf[0] = 0;
			time_buf[1] = 0;
			time_buf[2] = 0;
			time_buf[3] = 0;			
			sec_cen_total=0;
			
			stopwatch_flag = 1;//光标指示标志位给它置一（初始情况），以后再进入就是初始情况
			
			//给页面管理队列写数据
			My_Send_Task_Queue(PAGE_MENU);
			ScreenOff_Permit = 0;
		}
			
			
			
			
		//判断光标
		if(stopwatch_flag==1)//光标停在了第一行
		{
			if(open_clk==0)//没有计时
			{
				stopwatch_UI();
				OLED_ReverseArea(88,5,32,16);
				OLED_Update();
			}
			if(open_clk==1)//正在计时
			{
				stopwatch_UI();
				OLED_ReverseArea(88,5,32,16);
				OLED_Update();
			}
		}
		else if(stopwatch_flag==2)//光标停在了第一行
		{
				stopwatch_UI();
				OLED_ReverseArea(88,23,32,16);
				OLED_Update();
		}
		else if(stopwatch_flag==3)//光标停在了第三行
		{
				stopwatch_UI();
				OLED_ReverseArea(88,41,32,16);
				OLED_Update();
		}
	
		//RTOS延时
		vTaskDelay(pdMS_TO_TICKS(10));
}
}

/*----------------------------------------------------------------------------秒表光标操作函数*/

///////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////秒表功能	END////////
///////////////////////////////////////////////////////////////////////////////////////秒表功能	END////////
///////////////////////////////////////////////////////////////////////////////////////秒表功能	END////////
///////////////////////////////////////////////////////////////////////////////////////秒表功能	END////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////












/////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////游戏功能	BEGIN//////////////////////////////////////////////////////////////////////////////////////////
/////游戏功能	BEGIN//////////////////////////////////////////////////////////////////////////////////////////
/////游戏功能	BEGIN//////////////////////////////////////////////////////////////////////////////////////////
/////游戏功能	BEGIN//////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*游戏界面界面UI-------------------------------------------------------------------------------*/

void Show_dino_UI(void)
{
	OLED_Clear();
	OLED_ShowImage(0,0,16,16,Return);
	OLED_ShowChinese(0,16,"谷歌小恐龙");
	
}

/*-------------------------------------------------------------------------------游戏界面界面UI*/



/*游戏界面界面光标操作函数-------------------------------------------------------------------------------*/

uint8_t dino_Flag=1;//界面光标指示位
uint8_t game_Flag;//extern，是否进入了游戏的指示位，dino.c和main.c里用得到
//在dino.c的动画整合函数里，给game_Flag赋值1
//1：游戏进行中，0：游戏结束
void dinopage(void *argument)
{
	while(1)
	{
		OLED_Clear();
		
		uint8_t dino_Flag_Temp=0;
		if(game_Flag!=1)
		{KeyNum=Key_GetNum();}
		
		
		if(KeyNum !=0 && now_flag == 1)
		{
			key_irq = 1;
		}
		//判断按下哪个键（在亮屏情况下）
		if(KeyNum != 0 && now_flag == 0)
		{
			//亮屏计时手动复零
				time_count_ms = 0;
				time_count_s = 0;
		if(KeyNum==1&&game_Flag!=1)//上一项
		{
			dino_Flag--;
			if(dino_Flag<=0)
				{
				dino_Flag=2;
				}
		}
		else if(KeyNum==2&&game_Flag!=1)//下一项
			{
				dino_Flag++;
				if(dino_Flag>=3)
				{
					dino_Flag=1;
				}
			}
		else if(KeyNum==3&&game_Flag!=1)//确认
			{	
				OLED_Clear();//清屏准备跳转页面
				OLED_Update();	
			
				dino_Flag_Temp=dino_Flag;
				if(dino_Flag_Temp==2)
				{	game_Flag=1;}

				//注意这个dino_Flag_Temp在while开头要清零
			}
		}
			
				//按下确认键以后
				if(dino_Flag_Temp==1&&game_Flag!=1)//说明选中的是返回键并且按下了
				{
					//给页面管理队列写数据
					My_Send_Task_Queue(PAGE_MENU);
					ScreenOff_Permit = 0;
				}
				else if(game_Flag==1)//说明选中的是“日期时间设置”并且按下了，直接用game_Flag来说明
				{
					OLED_Clear();//先清屏
					DinoGame_Animation();//进入游戏
				}
				
				
				//按下左右移动键以后
				if(dino_Flag==1&&game_Flag!=1)
				{
					Show_dino_UI();
					OLED_ReverseArea(0,0,16,16);//选中即反色
					OLED_Update();
				}
				else if(dino_Flag==2&&game_Flag!=1)
				{	
					Show_dino_UI();
					OLED_ReverseArea(0,16,80,16);//选中即反色
					OLED_Update();
				}
			
				//RTOS延时
				vTaskDelay(pdMS_TO_TICKS(10));
}
}


/*-------------------------------------------------------------------------------游戏界面界面光标操作函数*/

///////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////游戏功能	END////////
///////////////////////////////////////////////////////////////////////////////////////游戏功能	END////////
///////////////////////////////////////////////////////////////////////////////////////游戏功能	END////////
///////////////////////////////////////////////////////////////////////////////////////游戏功能	END////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////










///////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////手电筒功能	BEGIN//////////////////////////////////////////////////////////////////////////////////////////
/////手电筒功能	BEGIN//////////////////////////////////////////////////////////////////////////////////////////
/////手电筒功能	BEGIN//////////////////////////////////////////////////////////////////////////////////////////
/////手电筒功能	BEGIN//////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*定义全局变量-------------------------------------------------------------------------------*/

uint8_t flash_open=0;//extern，手电筒有无开启的标志位（整个项目共用）
uint8_t flash_Flag=1;//界面光标指示位
uint8_t flash_power=75;

/*-------------------------------------------------------------------------------定义全局变量*/



/*手电筒界面UI-------------------------------------------------------------------------------*/



//手电筒界面UI
void Show_flash_UI(void)
{
	
	OLED_Clear();
	OLED_ShowImage(0,0,16,16,Return);
	if(flash_open==0)
	{ OLED_ShowChinese(0,16,"开启手电筒"); }
	else if(flash_open==1)
	{ OLED_ShowChinese(0,16,"关闭手电筒"); }

}
/*-------------------------------------------------------------------------------手电筒界面UI*/







/*手电筒光标操作-------------------------------------------------------------------------*/

void flashpage(void *argument)
{
	while(1)
	{
		uint8_t flash_Flag_Temp=0;
		KeyNum=Key_GetNum();
		
		if(KeyNum !=0 && now_flag == 1)
		{
			key_irq = 1;
		}
		//判断按下哪个键（在亮屏情况下）
		if(KeyNum != 0 && now_flag == 0)
		{
			//亮屏计时手动复零
				time_count_ms = 0;
				time_count_s = 0;
		if(KeyNum==1)//上一项
		{
			flash_Flag--;
			if(flash_Flag<=0)
				{
				flash_Flag=2;
				}
		}
		else if(KeyNum==2)//下一项
			{
				flash_Flag++;
				if(flash_Flag>=3)
				{
					flash_Flag=1;
				}
			}
		else if(KeyNum==3)//确认
			{	
				OLED_Clear();//清屏准备跳转页面
				OLED_Update();	
				flash_Flag_Temp=flash_Flag;
			}
		}
			
				//按下确认键以后
				if(flash_Flag_Temp==1)//说明选中的是返回键并且按下了
				{
					//给页面管理队列写数据
					My_Send_Task_Queue(PAGE_MENU);
					ScreenOff_Permit = 0;
				}
				else if(flash_open==0&&flash_Flag_Temp==2)//说明手电筒未开启，现在选中的是“开启手电筒”并且被按下
				{
					HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3, GPIO_PIN_RESET);
					flash_open=1;
				}
				else if(flash_open==1&&flash_Flag_Temp==2)//说明手电筒已开启，现在选中的是“关闭手电筒”并且被按下
				{
					HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3, GPIO_PIN_SET);
					flash_open=0;					
				}
				
				
				
				//按下左右移动键以后
				if(flash_Flag==1)
				{
					Show_flash_UI();
					OLED_ReverseArea(0,0,16,16);//选中即反色
					OLED_Update();
				}
				else if(flash_Flag==2)
				{	
					Show_flash_UI();
					OLED_ReverseArea(0,16,80,16);//选中即反色
					OLED_Update();
				}

				
				//RTOS延时
				vTaskDelay(pdMS_TO_TICKS(10));
	}
}

/*-------------------------------------------------------------------------手电筒光标操作*/

/////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////手电筒功能	END////////
///////////////////////////////////////////////////////////////////////////////////////手电筒功能	END////////
///////////////////////////////////////////////////////////////////////////////////////手电筒功能	END////////
///////////////////////////////////////////////////////////////////////////////////////手电筒功能	END////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////














///*MPU6050数据处理-------------------------------------------------------------------------*/

////MPU6050 6轴原始数据
//int16_t ax, ay,az;   // 加速度计
//int16_t gx, gy, gz; // 陀螺仪

////姿态角
//float Pitch= 0;  // 俯仰角：上下倾斜  ↑↓
//float Roll= 0;  // 翻滚角：左右倾斜  ←→
//float Yaw= 0;  // 偏航角：水平旋转


////互补滤波参数
//float a=0.9;        //互补滤波系数
//float Delta_t=0.005;	//采样周期

//float roll_g,pitch_g,yaw_g;//陀螺仪解算的欧拉角
//float roll_a,pitch_a;//加速度计算的欧拉角

//double Pi=3.1415927;


////计算欧拉角的函数
//void MPU6050_Calculate(void)
//{
//	Delay_ms(5);
//	MPU6050_GetData(&ax,&ay,&az,&gx,&gy,&gz);
//	
//	//通过陀螺仪解算欧拉角
//	roll_g=Roll+(float)gx*Delta_t;
//	pitch_g=Pitch+(float)gy*Delta_t;
//	yaw_g=Yaw+(float)gz*Delta_t;

//	//通过加速度计解算欧拉角
//	pitch_a=atan2((-1)*ax,az)*180/Pi;
//	roll_a=atan2(ay,az)*180/Pi;
//	
//	//通过互补滤波器进行数据融合
//	Roll=a*roll_g+(1-a)*roll_a;
//	Pitch=a*pitch_g+(1-a)*pitch_a;
//	Yaw=a*yaw_g;
//	
//}

///*-------------------------------------------------------------------------MPU6050数据处理*/



///*水平仪UI--------------------------------------------------------------------------------*/

//void level_UI(void)
//{
//	MPU6050_Calculate();
//	OLED_DrawCircle(64,32,30,0);//大圆圈
//	OLED_DrawCircle(64,32,31,0);//大圆圈

//	
//	//数学圆方程来解决小球运动自然性问题
//	
//	//逻辑：
//	//		当小球的坐标在圆框以外，即dist_sq > 28*28 时
//	//		圆框半径30，实心小球半径2，所以30-2=28
//	//		小球坐标改用由现在小球实际位置（可以在圆框外）ball_x和ball_y来计算这个位置相对圆心的角度
//	//		利用这个角度，用圆框半径和这个角度用三角函数配合
//	//		通过三角函数的简单计算便可以得到“在圆框外的小球这时在圆框上的投影”
//	//		利用这个“投影”便可以实现贴边的效果
//	
//	//小球原始坐标（未限制）
//	int16_t ball_x = 64 - Roll;
//	int16_t ball_y = 32 + Pitch;

//	//圆心(64,32)，圆框的半径是30
//	//这两个是小球到圆心的距离
//	int16_t dx = ball_x - 64;
//	int16_t dy = ball_y - 32;

//	//计算到圆心距离的平方
//	int32_t dist_sq = dx*dx + dy*dy;

//	//如果超出边界，就把小球“贴”在圆边上
//	if (dist_sq > 28*28)
//	{
//		//计算角度
//		float angle = atan2(dy, dx);

//		//重新计算小球位置（贴在边缘）
//		ball_x = 64 + 28 * cos(angle);
//		ball_y = 32 + 28 * sin(angle);
//	}

//	//画小球
//	OLED_DrawCircle(ball_x, ball_y, 4, 1);
//	
//}

///*--------------------------------------------------------------------------------水平仪UI*/





///*水平仪UI界面光标控制函数----------------------------------------------------------------*/

//int Gradienter(void)
//{
//	//刚进来这些要先清零，否则板子倾斜无法动弹
//	ax=0;
//	ay=0;
//	az=0;  
//	gx=0;
//	gy=0;
//	gz=0; 
//	Pitch = 0;   // 复位俯仰角
//	Roll = 0;    // 复位翻滚角
//	Yaw = 0;
//	roll_g=0;
//	pitch_g=0;
//	yaw_g=0;
//	roll_a=0;
//	pitch_a=0;
//	MPU6050_Init();
//		
//	while(1)
//	{
//		KeyNum=Key_GetNum();
//		if(KeyNum==3)//按下确认键
//		{
//			OLED_Clear();
//			OLED_Update();
//			
//			return 0;
//		}	
//	OLED_Clear();
//	level_UI();
//	OLED_Update();
//	}

//}

///*----------------------------------------------------------------水平仪UI界面光标控制函数*/






///////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////蜂鸣器音乐功能	Start////////////////////////////////////////////////////////////////////////////////////
///////蜂鸣器音乐功能	Start////////////////////////////////////////////////////////////////////////////////////
///////蜂鸣器音乐功能	Start////////////////////////////////////////////////////////////////////////////////////
///////蜂鸣器音乐功能	Start////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////


/*
前置知识：
		关于“系统Tick数”的理解，FreeRTOS这个机制里，
一上电就开始计数，以Tick为单位，就开始累计过了
几个Tick。
		xTaskGetTickCount()函数可以获取得到当前的Tick数。
*/



/*定义全局变量-------------------------------------------------------------------------------*/

	TaskHandle_t Music_Play_Handle;//播放音乐的任务的任务句柄
	
	uint8_t music_Flag = 1;
	uint8_t	music_Flag_Temp = 0;
	uint8_t music_state = 0;
	/*music_state ： 0 - 未播放			1 - 正在播放			2 - 暂停*/
	
	uint32_t music_total_time = 0;   // 歌曲总时长（ms）
	float    music_process    = 0;   // 真实进度 0.0~1.0
	
	uint32_t music_start_tick = 0;  // 播放开始时的系统Tick数
	uint32_t music_pause_tick = 0;   // 暂停时的系统Tick数
	uint32_t music_paused_time = 0;  // 累计暂停总时长(ms)（可多次暂停然后再继续）
	
	

/*-------------------------------------------------------------------------------定义全局变量*/



/*定义音乐频率/节拍表-------------------------------------------------------------------------------*/

/*********************************************************
  蜂鸣器通用音调频率表 (单位：Hz)
  C 调：低、中、高 三个八度，共 21 个音
**********************************************************/

// ---------- 低音 ----------
#define L1    262   // 低音 1
#define L2    294   // 低音 2
#define L3    330   // 低音 3
#define L4    349   // 低音 4
#define L5    392   // 低音 5
#define L6    440   // 低音 6
#define L7    494   // 低音 7

// ---------- 中音 ----------
#define M1    523   // 中音 1
#define M2    587   // 中音 2
#define M3    659   // 中音 3
#define M4    698   // 中音 4
#define M5    784   // 中音 5
#define M6    880   // 中音 6
#define M7    988   // 中音 7

// ---------- 高音 ----------
#define H1    1046  // 高音 1
#define H2    1175  // 高音 2
#define H3    1318  // 高音 3
#define H4    1397  // 高音 4
#define H5    1568  // 高音 5
#define H6    1760  // 高音 6
#define H7    1976  // 高音 7

// ---------- 休止符（静音） ----------
#define Pause    0    // 停顿


#define Beat_1      500   // 1拍
#define Beat_Half   250   // 半拍
#define Beat_2     1000   // 2拍

/*-------------------------------------------------------------------------------定义音乐频率/节拍表*/



/*歌谱-------------------------------------------------------------------------------*/

/*格式：音调，持续时间*/

/*《祝你生日快乐》*/
// 格式：{ 音调, 时长 }
uint16_t HappyBirthday_Music[] = {

    // 祝你生日快乐~
    M5, 150,  M5, 150,  M6, 300,
    M5, 300,  M1, 300,  M7, 600,

    // 祝你生日快乐~
    M5, 150,  M5, 150,  M6, 300,
    M5, 300,  M2, 300,  M1, 600,

    // 祝你生日快乐~
    M5, 150,  M5, 150,  M5, 300,
    M3, 300,  M1, 300,  M7, 300,  M6, 300,

    // 祝你生日快乐~
    H4, 150,  H4, 150,  H3, 300,
    M1, 300,  M2, 300,  M1, 600,

    // 延长尾音
    Pause, 300
};

/*-------------------------------------------------------------------------------歌谱*/




/*设置蜂鸣器频率（TIM4_CH1 PB6）-------------------------------------------------------------------------------*/

void Buzzer_SetFreq(uint16_t freq)
{
	if(freq == 0)
	{
		 // 静音：占空比设为0，停止发声
		__HAL_TIM_SET_COMPARE(&htim4,TIM_CHANNEL_1,0);
		HAL_TIM_PWM_Stop(&htim4,TIM_CHANNEL_1);
		return;
	}
	
	
	/*通过修改ARR（自动重装载值）来调整频率
		频率（freq） = 64MHz（计数器的时钟来源频率） / PSC（分频系数） / ARR（自动重装载值
		
		根据目标频率计算新的自动重装载值ARR（所以不用修改PSC，置改ARR）
		64MHz（计数器的时钟来源频率） / PSC（分频系数） = 1MHz
		所以 1MHz / freq 就是一个周期的计数次数
		这样得到目的freq
	*/
	uint16_t arr = 1000000 / freq;
	
	//更新ARR和比较值（要保持50%占空比，这个是决定音量的）
	__HAL_TIM_SET_AUTORELOAD(&htim4,arr - 1);
	__HAL_TIM_SET_COMPARE(&htim4,TIM_CHANNEL_1,arr / 2);	
}

/*-------------------------------------------------------------------------------设置蜂鸣器频率（TIM4_CH1 PB6）*/


/*任务函数：播放音乐-------------------------------------------------------------------------------*/

	uint16_t note_test;
	uint16_t delay_ms_test;
	
void Music_Play(void *argument)
{
	uint16_t note;//调值
	uint16_t delay_ms;//音调持续时间
	uint16_t index = 0;
	uint16_t len = sizeof(HappyBirthday_Music) / sizeof(HappyBirthday_Music[0]);
	
	uint16_t i = 0;
  music_total_time = 0;

  // 遍历整首歌，把所有时长加起来 = 总时间
  for(i=0; i<len; i+=2)
  {
    music_total_time += HappyBirthday_Music[i+1];
  }
	
	// 记录开始时间
  music_start_tick = xTaskGetTickCount();
	
	while(1)
	{
		if(index >= len)
		{
			index = 0;
			music_paused_time = 0; //清零累积的暂停时长
			Buzzer_SetFreq(0);
			vTaskDelay(pdMS_TO_TICKS(500));
			music_start_tick = xTaskGetTickCount(); // 重头开始计时
		}
		
		note = HappyBirthday_Music[index++];//调值从数组中取值
		delay_ms = HappyBirthday_Music[index++];//音调持续时间从数组中取值
		

////////		note_test = note;
////////		delay_ms_test = delay_ms;
				
		Buzzer_SetFreq(note);
		vTaskDelay(pdMS_TO_TICKS(delay_ms));//RTOS延时
	}
	
}

/*-------------------------------------------------------------------------------任务函数：播放音乐*/




/*音乐进度条-------------------------------------------------------------------------------*/


void Music_ProgressBar(void)
{
	// 固定配置
	const uint8_t x_start = 2;
	const uint8_t y_pos   = 58;
	const uint8_t x_end   = 126;
	const uint8_t height  = 4;
	
	
	/*==============计算进度===============*/
	// 总长度
	int total_width = x_end - x_start;

	// 当前系统Tick数
	uint32_t now_tick = xTaskGetTickCount();
	
	// 当前实际累积到的播放时长
	uint32_t real_ms;

	if(music_state == 2)  // 暂停 → 进度条固定不动
	{
		real_ms = (music_pause_tick - music_start_tick) * portTICK_PERIOD_MS	- music_paused_time;
	}
	else  // 播放 → 正常走
	{
		real_ms = (now_tick - music_start_tick) * portTICK_PERIOD_MS - music_paused_time;
	}
	
	// 边界保护
	if(real_ms > music_total_time) real_ms = music_total_time;

	music_process = (float)real_ms / music_total_time;
	
	
	/*=============显示进度条==============*/
	// 当前进度条宽度
	int bar_width = (int)(total_width * music_process + 0.5f);//加个+ 0.5f，四舍五入，因为int是取这个数字（带小数）的整数部分，所以是比这个数字小的整数
	
	// 边界保护
	if(bar_width < 0) bar_width = 0;
	if(bar_width > total_width) bar_width = total_width;
    
	// 显示进度条
	OLED_ReverseArea(2,58,bar_width,4);
	
	
}

/*-------------------------------------------------------------------------------音乐进度条*/




/*蜂鸣器音乐界面UI-------------------------------------------------------------------------------*/

void Show_Music_UI(void)
{
	OLED_Clear();
	OLED_ShowImage(0,0,16,16,Return);
	
//test//	OLED_Printf(0,48,OLED_8X16,"N:%d,D:%d",note_test,delay_ms_test);

	
	if(music_state == 0)
	{
		OLED_ShowChinese(0,16,"播放音乐"); 
	}
	else if(music_state==1)
	{
		OLED_ShowImage(0,56,128,8,Process_Frame);//显示进度框
		Music_ProgressBar();//显示进度条
		
		OLED_ShowChinese(0,16,"暂停播放"); 
		OLED_ShowChinese(0,32,"结束播放"); 
	}
	else if(music_state==2)
	{
		OLED_ShowImage(0,56,128,8,Process_Frame);//显示进度框
		Music_ProgressBar();//显示进度条
		
		OLED_ShowChinese(0,16,"继续播放"); 
		OLED_ShowChinese(0,32,"结束播放"); 
	}
	

	
}
/*-------------------------------------------------------------------------------蜂鸣器音乐界面UI*/



/*蜂鸣器音乐光标操作-------------------------------------------------------------------------*/

void musicpage(void *argument)
{
	while(1)
	{
		uint8_t flash_Flag_Temp=0;
		KeyNum=Key_GetNum();
		
		if(KeyNum !=0 && now_flag == 1)
		{
			key_irq = 1;
		}
		//判断按下哪个键（在亮屏情况下）
		if(KeyNum != 0 && now_flag == 0)
		{
			//亮屏计时手动复零
				time_count_ms = 0;
				time_count_s = 0;
		if(KeyNum==1)//上一项
		{
			music_Flag--;
			if(music_Flag<=0)
				{
					if(music_state == 0)//说明音乐未播放，只有两个选项
					{
						music_Flag = 2;
					}
					else//说明音乐已播放或暂停，有三个选项（+“结束音乐”）
					{
						music_Flag = 3;
					}
				}
		}
		else if(KeyNum==2)//下一项
			{
				music_Flag++;
				if(music_state == 0)//说明音乐未播放，只有两个选项
					{
						if(music_Flag>=3)
						{
							music_Flag=1;
						}
					}
					else//说明音乐已播放或暂停，有三个选项（+“结束音乐”）
					{
						if(music_Flag>=4)
						{
							music_Flag=1;
						}
					}
				
			}
		else if(KeyNum==3)//确认
			{	
				OLED_Clear();//清屏准备跳转页面
				OLED_Update();	
				music_Flag_Temp = music_Flag;
			}
		}
			
		//按下确认键以后
		if(music_Flag_Temp != 0)
		{
				if(music_Flag_Temp==1)//说明选中的是返回键并且按下了
				{
					//给页面管理队列写数据
					My_Send_Task_Queue(PAGE_MENU);
					ScreenOff_Permit = 0;
				}
				
				else if(music_state == 0&&music_Flag_Temp == 2)//未播放 → 正在播放		说明音乐未播放，现在选中的是“播放音乐”并且被按下
				{
					//创建音乐播放任务
					xTaskCreate(Music_Play,"Task_music_play",128*4,NULL,(osPriority_t) osPriorityNormal + 1,&Music_Play_Handle);
					HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_1);
					
					
					music_state=1;// 切换为播放状态
				}
				else if(music_state == 1&&music_Flag_Temp == 2)//正在播放 → 暂停播放		说明音乐正在播放，现在选中的是“暂停播放”并且被按下
				{
					// 挂起音乐播放任务
					vTaskSuspend(Music_Play_Handle);
					// 记录暂停瞬间的Tick是到哪了（FreeRTOS的Tick）
					music_pause_tick = xTaskGetTickCount(); 
					
					Buzzer_SetFreq(0);//静音
					
					music_state=2;// 切换为暂停状态					
				}
				else if(music_state == 2&&music_Flag_Temp == 2)//暂停播放 → 继续播放		说明音乐暂停播放，现在选中的是“继续播放”并且被按下
				{
					// 计算得到本次暂停的时长并且累加
					// 注意！是累加，所以可以无限次暂停再重新继续
					music_paused_time += (xTaskGetTickCount() - music_pause_tick) * portTICK_PERIOD_MS;
					HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_1);
					
					// 释放音乐播放任务
					vTaskResume(Music_Play_Handle);
					
					music_state=1;// 切换为播放状态					
				}
				else if(music_Flag_Temp == 3)//暂停/正在播放 → 结束播放		现在选中的是“结束播放”并且被按下
				{
					//删除音乐播放任务
					vTaskDelete(Music_Play_Handle);
					Music_Play_Handle = NULL; 
					Buzzer_SetFreq(0);//静音
					
					music_state=0;// 切换为未播放状态			
					music_Flag = 1;
					
					music_paused_time = 0; //清零累积的暂停时长
				}
				
				music_Flag_Temp = 0;
			}

				//按下左右移动键以后
				if(music_Flag==1)
				{
					Show_Music_UI();
					OLED_ReverseArea(0,0,16,16);//选中即反色
					OLED_Update();
				}
				else if(music_Flag==2)
				{	
					Show_Music_UI();
					OLED_ReverseArea(0,16,64,16);//选中即反色
					OLED_Update();
				}
				else if(music_Flag==3)
				{	
					Show_Music_UI();
					OLED_ReverseArea(0,32,64,16);//选中即反色
					OLED_Update();
				}

				
				//RTOS延时
				vTaskDelay(pdMS_TO_TICKS(10));
}
}

/*-------------------------------------------------------------------------手电筒光标操作*/

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////蜂鸣器音乐功能	END////////
///////////////////////////////////////////////////////////////////////////////////////蜂鸣器音乐功能	END////////
///////////////////////////////////////////////////////////////////////////////////////蜂鸣器音乐功能	END////////
///////////////////////////////////////////////////////////////////////////////////////蜂鸣器音乐功能	END////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
                                                                                                           


